app/controllers/group_events_controller.rb

  def index
    @group_events = GroupEvent.all
---
SELECT "group_events".* FROM "group_events"

  def create
    @user = User.find(params[:user_id])
    @group_event = @user.group_events.build(group_event_params)
    if @group_event.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "group_events" ("duration", "name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["duration", 4], ["name", "Event 1"], ["description", "We are using __Markdown__ now!"], ["user_id", 1], ["created_at", 2016-12-25 13:51:29 UTC], ["updated_at", 2016-12-25 13:51:29 UTC]]

  def update
    if @group_event.update(group_event_params)
---
UPDATE "group_events" SET "description" = ?, "duration" = ?, "name" = ?, "updated_at" = ? WHERE "group_events"."id" = ?  [["description", "We are using __Markdown__ now!"], ["duration", 8], ["name", "Event 2"], ["updated_at", 2016-12-25 13:58:08 UTC], ["id", 1]]

  def destroy
    binding.pry
    @group_event.each do |event|
      event.removed = true
      event.save
---
UPDATE "group_events" SET "description" = ?, "removed" = ?, "updated_at" = ? WHERE "group_events"."id" = ?  [["description", "<p>We are using <strong>Markdown</strong> now!</p>\n"], ["removed", true], ["updated_at", 2016-12-25 14:03:44 UTC], ["id", 1]]

    def set_group_event
    	@user = User.find(params[:user_id])
      @group_event = @user.group_events
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "group_events".* FROM "group_events" WHERE "group_events"."user_id" = ?  [["user_id", 1]]