app/controllers/users_controller.rb

  def show_publishable
    @group_event = @user.group_events.active
---
SELECT "group_events".* FROM "group_events" WHERE "group_events"."user_id" = ?  [["user_id", 1]]